### 101 Pandas Exercises for Data Analysis
https://www.machinelearningplus.com/python/101-pandas-exercises-python/

In [1]:
import numpy as np
import pandas as pd

### 51. Find the row position of the 5th largest value of column 'a' in df.

In [16]:
df = pd.DataFrame(np.random.randint(1, 30, 30).reshape(10,-1), columns=list('abc'))
df

    a   b   c
0  24   2  19
1   3   6  25
2  24   7   8
3  24   4  28
4  16  21  25
5  17  10   2
6  20   1  27
7  26  27  15
8   8  21  10
9   9   9  22

In [37]:
# Solution
# df.shape[0] is total row number
n = 2
df['a'].argsort()[df.shape[0]-n]

3

### 52. In ser, find the position of the 2nd largest value greater than the mean.

In [39]:
ser = pd.Series(np.random.randint(1, 100, 15))
ser

0     86
1      3
2     77
3     79
4     48
5      1
6     48
7     59
8     84
9     13
10    71
11    94
12    36
13    11
14    27
dtype: int32

In [42]:
round(ser.mean())

49.0

In [44]:
np.argwhere(ser > ser.mean())[1]

array([2], dtype=int64)

### 53 .Get the last two rows of df whose row sum is greater than 100.

In [45]:
df = pd.DataFrame(np.random.randint(10, 40, 60).reshape(-1, 4))
df

     0   1   2   3
0   18  18  30  17
1   19  22  20  17
2   24  31  22  33
3   30  26  25  34
4   11  37  26  30
5   34  25  24  26
6   11  28  18  19
7   17  21  31  30
8   20  30  28  22
9   18  33  19  29
10  30  37  35  28
11  23  36  18  21
12  34  34  27  26
13  20  13  33  36
14  18  38  38  26

In [47]:
rowsums = df.apply(np.sum, axis=1)
rowsums

0      83
1      78
2     110
3     115
4     104
5     109
6      76
7      99
8     100
9      99
10    130
11     98
12    121
13    102
14    120
dtype: int64

In [54]:
last_two_rows = df.iloc[np.where(rowsums > 100)[0][-2:], :]
last_two_rows

     0   1   2   3
13  20  13  33  36
14  18  38  38  26

In [57]:
np.where(rowsums > 100)[0][-2:]

array([13, 14], dtype=int64)

### 54. Replace all values of ser in the lower 5%ile and greater than 95%ile with respective 5th and 95th %ile value.

In [60]:
ser = pd.Series(np.logspace(-2, 2, 30))
ser.head()

0    0.010000
1    0.013738
2    0.018874
3    0.025929
4    0.035622
dtype: float64

In [61]:
# Solution
def cap_outliers(ser, low_perc, high_perc):
    low, high = ser.quantile([low_perc, high_perc])
    print(low_perc, '%ile: ', low, '|', high_perc, '%ile: ', high)
    ser[ser < low] = low
    ser[ser > high] = high
    return(ser)

In [62]:
capped_ser = cap_outliers(ser, .05, .95)

0.05 %ile:  0.016049294076965887 | 0.95 %ile:  63.876672220183934

In [63]:
ser

0      0.016049
1      0.016049
2      0.018874
3      0.025929
4      0.035622
5      0.048939
6      0.067234
7      0.092367
8      0.126896
9      0.174333
10     0.239503
11     0.329034
12     0.452035
13     0.621017
14     0.853168
15     1.172102
16     1.610262
17     2.212216
18     3.039195
19     4.175319
20     5.736153
21     7.880463
22    10.826367
23    14.873521
24    20.433597
25    28.072162
26    38.566204
27    52.983169
28    63.876672
29    63.876672
dtype: float64

### 55. Reshape df to the largest possible square with negative values removed. Drop the smallest values if need be. The order of the positive numbers in the result should remain the same as the original.

In [64]:
df = pd.DataFrame(np.random.randint(-20, 50, 100).reshape(10,-1))
df.head()

    0   1   2   3   4   5   6   7   8   9
0  -2  37 -20  15   4  24  43   2  47  -1
1  31 -20  27   0 -14  35 -15   5 -14  20
2  33 -17  21  43  24 -19  22 -13 -17  -5
3 -14 -11  31  -2  11  38  19   0  42  32
4   8  23  42  38  35 -12  40  40  32  49

In [66]:
# Solution
# Step 1: remove negative values from arr
# flatten() make array into one dimension
arr = df[df > 0].values.flatten()
arr

array([nan, 37., nan, 15.,  4., 24., 43.,  2., 47., nan, 31., nan, 27.,
       nan, nan, 35., nan,  5., nan, 20., 33., nan, 21., 43., 24., nan,
       22., nan, nan, nan, nan, nan, 31., nan, 11., 38., 19., nan, 42.,
       32.,  8., 23., 42., 38., 35., nan, 40., 40., 32., 49., 12., 32.,
       29., nan,  3., nan, nan, 15., nan, 38., nan, 18., 15., nan,  5.,
       42., 21., 26., 32., nan, nan, 10., nan, 29., nan, nan, 48., nan,
       49., 20., 40., nan, 49., 24., nan, 31.,  5.,  3., nan,  5., 24.,
        9., nan, nan, nan, 44., 32., nan, nan, nan])

In [68]:
arr_qualified = arr[~np.isnan(arr)]
arr_qualified

array([37., 15.,  4., 24., 43.,  2., 47., 31., 27., 35.,  5., 20., 33.,
       21., 43., 24., 22., 31., 11., 38., 19., 42., 32.,  8., 23., 42.,
       38., 35., 40., 40., 32., 49., 12., 32., 29.,  3., 15., 38., 18.,
       15.,  5., 42., 21., 26., 32., 10., 29., 48., 49., 20., 40., 49.,
       24., 31.,  5.,  3.,  5., 24.,  9., 44., 32.])

In [71]:
arr_qualified.shape[0]**.5

7.810249675906654

In [70]:
# Step 2: find side-length of largest possible square
# np.floor() round down, np.ceil() round up
n = int(np.floor(arr_qualified.shape[0]**.5))
n

7

In [72]:
# Step 3: Take top n^2 items without changing positions ???
top_indexes = np.argsort(arr_qualified)[::-1]
top_indexes

array([51, 31, 48, 47,  6, 59,  4, 14, 41, 21, 25, 29, 28, 50, 37, 26, 19,
        0, 27,  9, 12, 22, 33, 60, 30, 44, 17, 53,  7, 46, 34,  8, 43, 57,
        3, 52, 15, 24, 16, 42, 13, 49, 11, 20, 38,  1, 36, 39, 32, 18, 45,
       58, 23, 54, 10, 56, 40,  2, 55, 35,  5], dtype=int64)

In [73]:
output = np.take(arr_qualified, sorted(top_indexes[:n**2])).reshape(n, -1)
output

array([[37., 15., 24., 43., 47., 31., 27.],
       [35., 20., 33., 21., 43., 24., 22.],
       [31., 38., 19., 42., 32., 23., 42.],
       [38., 35., 40., 40., 32., 49., 12.],
       [32., 29., 15., 38., 18., 15., 42.],
       [21., 26., 32., 29., 48., 49., 20.],
       [40., 49., 24., 31., 24., 44., 32.]])

### 56. Swap rows 1 and 2 in df

In [74]:
df = pd.DataFrame(np.arange(25).reshape(5, -1))
df

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24

In [75]:
# Solution
def swap_rows(df, i1, i2):
    a, b = df.iloc[i1, :].copy(), df.iloc[i2, :].copy()
    df.iloc[i1, :], df.iloc[i2, :] = b, a
    return df

swap_rows(df, 1, 2)

    0   1   2   3   4
0   0   1   2   3   4
1  10  11  12  13  14
2   5   6   7   8   9
3  15  16  17  18  19
4  20  21  22  23  24

### 57. Reverse all the rows of dataframe df.

In [76]:
df = pd.DataFrame(np.arange(25).reshape(5, -1))
df

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24

In [77]:
# Solution 1
df.iloc[::-1, :]

    0   1   2   3   4
4  20  21  22  23  24
3  15  16  17  18  19
2  10  11  12  13  14
1   5   6   7   8   9
0   0   1   2   3   4

In [78]:
# Solution 2
df.loc[df.index[::-1], :]

    0   1   2   3   4
4  20  21  22  23  24
3  15  16  17  18  19
2  10  11  12  13  14
1   5   6   7   8   9
0   0   1   2   3   4

### 58. Get one-hot encodings for column 'a' in the dataframe df and append it as columns.

In [80]:
df = pd.DataFrame(np.arange(25).reshape(5,-1), columns=list('abcde'))
df

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24

In [81]:
# Solution
df_onehot = pd.concat([pd.get_dummies(df['a']), df[list('bcde')]], axis=1)
df_onehot

   0  5  10  15  20   b   c   d   e
0  1  0   0   0   0   1   2   3   4
1  0  1   0   0   0   6   7   8   9
2  0  0   1   0   0  11  12  13  14
3  0  0   0   1   0  16  17  18  19
4  0  0   0   0   1  21  22  23  24

### 59. Obtain the column name with the highest number of row-wise maximumâ€™s in df.

In [86]:
# which column has the most row maximum

In [82]:
df = pd.DataFrame(np.random.randint(1,100, 40).reshape(10, -1))
df

    0   1   2   3
0  74  65  82   1
1  98  28  93  29
2  97  11  72  35
3  74  31  41  81
4   8  13  83  15
5  44  35  97  18
6  65  91  18  80
7  24  39  74  28
8  64  46  50  45
9  58  62  23  39

In [87]:
df.apply(np.argmax, axis=1)

0    2
1    0
2    0
3    3
4    2
5    2
6    1
7    2
8    0
9    1
dtype: int64

In [88]:
df.apply(np.argmax, axis=1).value_counts()

2    4
0    3
1    2
3    1
dtype: int64

In [89]:
df.apply(np.argmax, axis=1).value_counts().index[0]

2

### 60. Create a new column such that, each row contains the row number of nearest row-record by euclidean distance.

In [90]:
df = pd.DataFrame(np.random.randint(1,100, 40).reshape(10, -1), columns=list('pqrs'), index=list('abcdefghij'))
df

    p   q   r   s
a  93  44  81  52
b  31  75  10  66
c  21  69  86  56
d  66  96  85   1
e  24  62  15   6
f  32  58  34  41
g  51  96  33  22
h  87  30  38  28
i  77  71  51  57
j  16  65  81  99

In [91]:
# init outputs
nearest_rows = []
nearest_distance = []

In [92]:
# iterate rows.????
for i, row in df.iterrows():
    curr = row
    rest = df.drop(i)
    e_dists = {}  # init dict to store euclidean dists for current row.
    # iterate rest of rows for current row
    for j, contestant in rest.iterrows():
        # compute euclidean dist and update e_dists
        e_dists.update({j: round(np.linalg.norm(curr.values - contestant.values))})
    # update nearest row to current row and the distance value
    nearest_rows.append(max(e_dists, key=e_dists.get))
    nearest_distance.append(max(e_dists.values()))

df['nearest_row'] = nearest_rows
df['dist'] = nearest_distance